TutoElectroWeb/STM32_SGP40/exemples/exemple_sgp40_polling_diagnostic.c
/* USER CODE BEGIN Header */
/**
 ******************************************************************************
 * @file           : 'exemple_sgp40_polling_diagnostic.c'
 * @brief          : [Diagnostic] Exemple SGP40 de debug VOC détaillé
 ******************************************************************************
 * @details
 * Cet exemple est orienté diagnostic terrain quand la valeur VOC brute évolue
 * peu ou de manière incohérente. Il aide à valider la chaîne complète : bus I2C,
 * échanges trames, compensation environnementale et cadence de mesure.
 *
 * Opérations principales :
 * - Vérification de la présence du capteur sur I2C
 * - Affichage des données brutes pour inspection
 * - Tests de compensation température/humidité
 * - Monitoring rapproché des mesures VOC
 *
 * Configuration matérielle :
 * - I2C choisi dans CubeMX : mode standard/fast avec pull-up externes 4.7kΩ
 * - UART2 : console debug 115200 bauds
 *
 * @note
 * - Exemple destiné au debug applicatif, pas à un profil production.
 * - Les traces printf sont volontairement verbeuses.
 * - API couverte : SGP40_Init, SGP40_SelfTest, SGP40_SetCompensation,
 *   SGP40_SetSampleInterval, SGP40_MeasureRaw, SGP40_CalculateVOCIndex,
 *   SGP40_GetVOCCategory, SGP40_VOCCategoryToString, SGP40_StatusToString.
 ******************************************************************************
 */
/* USER CODE END Header */
/* Includes ------------------------------------------------------------------*/
#include "main.h"

/* Private includes ----------------------------------------------------------*/
/* USER CODE BEGIN Includes */
#include "STM32_SGP40.h"
#include <stdio.h>
#include <stdlib.h>
/* USER CODE END Includes */

/* Private typedef -----------------------------------------------------------*/
/* USER CODE BEGIN PTD */
/* USER CODE END PTD */

/* Private define ------------------------------------------------------------*/
/* USER CODE BEGIN PD */
#define LOG_NAME "exemple_sgp40_polling_diagnostic"  ///< Nom pour identification dans les logs
#define DEBUG_WARMUP_SAMPLES  30U    ///< Nombre d'échantillons warmup capteur + algo VOC
/* #define SGP40_DEBUG_ENABLE */  ///< Décommenter pour activer les traces textuelles — laisser commenté en production
/* USER CODE END PD */

/* Private macro -------------------------------------------------------------*/
/* USER CODE BEGIN PM */
/* USER CODE END PM */

/* Private variables ---------------------------------------------------------*/
I2C_HandleTypeDef hi2c3;
UART_HandleTypeDef huart2;

/* USER CODE BEGIN PV */
SGP40_HandleTypeDef hsgp40;  ///< Handle principal du capteur SGP40
/* USER CODE END PV */

/* Private function prototypes -----------------------------------------------*/
void SystemClock_Config(void);
static void MX_GPIO_Init(void);
static void MX_USART2_UART_Init(void);
static void MX_I2C3_Init(void);

/* USER CODE BEGIN PFP */
/* USER CODE END PFP */

/* Private user code ---------------------------------------------------------*/
/* USER CODE BEGIN 0 */
/**
  * @brief  Retransmet un caractère via UART pour redirection stdout (printf).
  * @param  ch  Caractère à transmettre.
  * @retval Caractère transmis.
  */
int __io_putchar(int ch) {
    HAL_UART_Transmit(&huart2, (uint8_t*) &ch, 1, 0xFFFF); // Envoi bloquant vers UART2 (console debug 115200 bauds)
    return ch;
}
/* USER CODE END 0 */

/**
  * @brief  The application entry point.
  * @retval int
  */
int main(void)
{

  /* USER CODE BEGIN 1 */

  /* USER CODE END 1 */

  /* MCU Configuration--------------------------------------------------------*/

  /* Reset of all peripherals, Initializes the Flash interface and the Systick. */
  HAL_Init();

  /* USER CODE BEGIN Init */

  /* USER CODE END Init */

  /* Configure the system clock */
  SystemClock_Config();

  /* USER CODE BEGIN SysInit */

  /* USER CODE END SysInit */

  /* Initialize all configured peripherals */
  MX_GPIO_Init();
  MX_USART2_UART_Init();
  MX_I2C3_Init();

  /* USER CODE BEGIN 2 */
  /* 1) Bannière exemple */
  printf("\r\n================================================\r\n");  // Ligne de séparation
  printf("  Fichier: " LOG_NAME "\r\n");                           // Identification de l'exemple
  printf("  SGP40 - DEBUG Détaillé (diagnostic VOC)\r\n");           // Titre du programme
  printf("================================================\r\n\r\n");  // Ligne de séparation

  /* 2) Configuration du handle SGP40 */
  /* SGP40_Init() configure i2c_timeout au défaut (SGP40_DEFAULT_TIMEOUT_MS) — rien à faire ici */

    /* Test 1: Vérification I2C */
    printf("--- Test 1: Communication I2C ---\r\n");                                   // Introduit le test de présence I2C
    HAL_StatusTypeDef hal_status;                                                           // Statut bas niveau HAL pour diagnostic bus

    hal_status = HAL_I2C_IsDeviceReady(&hi2c3, (uint16_t)(SGP40_I2C_ADDR_7B << 1), 3, 100);              // Sonde la présence du périphérique I2C sélectionné
    if (hal_status != HAL_OK) {  // Vérifie si le capteur répond bien sur le bus I2C
        printf("ERREUR  SGP40 non détecté sur I2C (adresse 0x%02X)\r\n", SGP40_I2C_ADDR_7B);  // Affiche l'adresse cible non détectée
        printf("   Code HAL: %d\r\n", hal_status);                                                     // Affiche le code d'erreur HAL bas niveau
        printf("   -> Vérifier connexions SDA/SCL/VCC/GND\r\n");                                      // Rappelle les vérifications de câblage
        printf("   -> Vérifier pull-up 4.7kΩ sur SDA/SCL\r\n\r\n");                                  // Rappelle la présence des résistances de tirage
        Error_Handler();                                                                                // Stoppe en cas d'absence capteur
    }
    printf("OK  SGP40 détecté sur I2C\r\n\r\n");                                      // Confirme la présence I2C du capteur
    HAL_Delay(100U);                                                                               // Laisse une petite temporisation après détection I2C

    /* Test 2: Initialisation */
    printf("--- Test 2: Initialisation ---\r\n");                                      // Introduit le test d'initialisation
    SGP40_Status status = SGP40_Init(&hsgp40, &hi2c3);                                                            // Initialise le capteur
    if (status != SGP40_OK) {  // Vérifie le succès de l'initialisation capteur
        printf("ERREUR  Erreur init: %s\r\n", SGP40_StatusToString(status));               // Affiche l'erreur d'initialisation capteur
        Error_Handler();                                                                                // Stoppe en cas d'échec d'initialisation
    }

    status = SGP40_SetSampleInterval(&hsgp40, 500U);                                        // Cadence debug à 2 Hz
    if (status != SGP40_OK) {  // Vérifie le succès de la configuration de cadence debug
      printf("ERREUR  Erreur intervalle debug: %s\r\n", SGP40_StatusToString(status));    // Affiche l'erreur de cadence debug
      Error_Handler();                                                                                // Stoppe en cas d'échec de configuration cadence
    }

    printf("OK  SGP40 initialisé\r\n");                                                // Confirme l'initialisation réussie
        uint64_t serial_num = 0U;                                                       // Récupération du numéro de série via l'API publique
        (void)SGP40_GetSerialNumber(&hsgp40, &serial_num);
        printf("   Serial: 0x%04lX%08lX\r\n\r\n",                                       // Affiche le serial capteur
          (unsigned long)((serial_num >> 32) & 0xFFFFu),
          (unsigned long)(serial_num & 0xFFFFFFFFu));
    HAL_Delay(100U);                                                                               // Stabilise la console avant test suivant

    /* 3) Campagne de tests de validation */

