TutoElectroWeb/STM32_SGP40/exemples/exemple_sgp40_polling_diagnostic.c
    /* Test 3: Auto-test capteur */
    printf("--- Test 3: Auto-test heater ---\r\n");                                   // Introduit le test d'auto-diagnostic
    uint16_t test_result;                                                                              // Résultat brut du self-test
    status = SGP40_SelfTest(&hsgp40, &test_result);                                                    // Lance le self-test capteur
    if (status != SGP40_OK) {  // Vérifie le résultat du self-test interne
        printf("ATTENTION   Auto-test ÉCHOUÉ (0x%04X)\r\n", test_result);                            // Signale un auto-test non conforme
        printf("   -> Capteur peut-être défectueux\r\n\r\n");                                       // Propose une interprétation du défaut
      } else {                                                                                           // Branche succès du self-test
        printf("OK  Auto-test OK (0x%04X)\r\n\r\n", test_result);                                  // Confirme la réussite de l'auto-test
    }
    HAL_Delay(500U);                                                                               // Temporisation entre deux tests

    /* Test 4: Warmup (30 mesures pour stabiliser capteur + algo VOC) */
    const uint32_t warmup_samples = DEBUG_WARMUP_SAMPLES;                                   // Nombre d'échantillons utilisés pour le warmup
    printf("--- Test 4: Warmup capteur (%lu mesures) ---\r\n", warmup_samples);        // Introduit la phase de warmup
    printf("ATTENTE  Le heater et l'algo VOC ont besoin de temps pour se stabiliser...\r\n\r\n"); // Explique l'objectif de la phase warmup

    uint16_t warmup_values[DEBUG_WARMUP_SAMPLES];                                           // Buffer des valeurs raw collectées en warmup
    for (uint32_t i = 0; i < warmup_samples; i++) {  // Acquiert les échantillons de warmup
        status = SGP40_MeasureRaw(&hsgp40, &warmup_values[i]);                              // Lecture VOC raw pour l'échantillon i
        if (status == SGP40_OK) {  // Traite uniquement les mesures valides
        uint16_t warmup_index;                                                              // Index temporaire calculé pour amorcer l'algo VOC
        (void)SGP40_CalculateVOCIndex(&hsgp40, warmup_values[i], &warmup_index);           // Conversion raw->index pendant warmup
        printf("  [%2lu] VOC raw = %5u\r\n", i + 1U, warmup_values[i]);                              // Affiche chaque mesure brute de warmup
        } else {                                                                                        // Branche erreur de mesure durant warmup
        printf("  [%2lu] Erreur: %s\r\n", i + 1U, SGP40_StatusToString(status));           // Affiche l'erreur sur l'échantillon courant
        }
        HAL_Delay(1000U);  // 1 mesure/seconde pendant warmup
    }

    // Calcul variation warmup
    uint16_t warm_min = warmup_values[0];                                                   // Minimum observé durant le warmup
    uint16_t warm_max = warmup_values[0];                                                   // Maximum observé durant le warmup
    for (uint32_t i = 1U; i < warmup_samples; i++) {  // Balaye les valeurs pour trouver min et max
        if (warmup_values[i] < warm_min) warm_min = warmup_values[i];  // Met à jour le minimum de warmup
        if (warmup_values[i] > warm_max) warm_max = warmup_values[i];  // Met à jour le maximum de warmup
    }

    printf("\r\nRésumé warmup:\r\n");                                                               // Introduit le bilan warmup
    printf("  MIN = %u, MAX = %u, Variation = %u\r\n", warm_min, warm_max, warm_max - warm_min);   // Affiche min/max/variation warmup

    if (warm_max - warm_min < 100) {  // Détecte une variation trop faible après warmup
      printf("  INFO  Variation faible (<100) : possible en air stable ou capteur deja chaud\r\n"); // Donne une interprétation de variation faible
      printf("  VERIF  Faire un test avec stimulus (souffle/fumee) avant de conclure\r\n");         // Propose une vérification complémentaire
    }
    printf("\r\n");                                                                                  // Sépare visuellement les sections
    HAL_Delay(1000U);                                                                               // Temporisation avant test suivant

    /* Test 5: Mesures sans compensation (valeurs par défaut) */
    printf("--- Test 5: Mesure SANS compensation (défaut T=25°C, RH=50%%) ---\r\n");  // Introduit le test en compensation nominale
    SGP40_SetCompensation(&hsgp40, 25.0f, 50.0f);                                           // Compensation nominale

    uint16_t voc_default;                                                                    // Référence raw avec compensation nominale
    status = SGP40_MeasureRaw(&hsgp40, &voc_default);                                                   // Mesure brute en compensation nominale
    if (status == SGP40_OK) {  // Vérifie la mesure brute nominale
        printf("OK  VOC raw (défaut) = %u\r\n", voc_default);                                         // Affiche la référence nominale
      } else {                                                                                             // Branche erreur de mesure nominale
        printf("ERREUR  Erreur: %s\r\n", SGP40_StatusToString(status));                     // Affiche l'erreur de mesure
    }
    printf("\r\n");                                                                                  // Sépare visuellement les sections
    HAL_Delay(1000U);                                                                               // Temporisation avant test suivant

    /* Test 6: Mesures avec compensation extrême (pour forcer différence) */
    printf("--- Test 6: Mesure AVEC compensation extrême (T=0°C, RH=0%%) ---\r\n");   // Introduit le test de sensibilité compensation
    printf("ATTENTION   Compensation volontairement fausse pour tester impact\r\n\r\n");            // Avertit que ce test force un cas extrême

    SGP40_SetCompensation(&hsgp40, 0.0f, 0.0f);                                             // Compensation extrême pour test de sensibilité

    uint16_t voc_extreme;                                                                    // Mesure raw avec compensation extrême
    status = SGP40_MeasureRaw(&hsgp40, &voc_extreme);                                                   // Mesure brute en compensation extrême
    if (status == SGP40_OK) {  // Vérifie la mesure brute en compensation extrême
        printf("OK  VOC raw (T=0,RH=0) = %u\r\n", voc_extreme);                                      // Affiche la mesure extrême
        printf("   Écart vs défaut = %d\r\n", (int)voc_extreme - (int)voc_default);                 // Affiche l'écart vs référence

        if (abs((int)voc_extreme - (int)voc_default) < 50) {  // Signale une faible sensibilité à la compensation
            printf("   ATTENTION   PROBLÈME: Compensation n'a presque aucun effet!\r\n");           // Signale une sensibilité anormale
            printf("   -> Capteur peut-être défectueux ou problème I2C\r\n");                        // Donne une piste de diagnostic
          }
        } else {                                                                                             // Branche erreur de mesure extrême
          printf("ERREUR  Erreur: %s\r\n", SGP40_StatusToString(status));                     // Affiche l'erreur de mesure
    }
    printf("\r\n");                                                                                  // Sépare visuellement les sections
    HAL_Delay(1000U);                                                                               // Temporisation avant monitoring

    /* Restaurer compensation normale */
    SGP40_SetCompensation(&hsgp40, 25.0f, 50.0f);                                                       // Restaure la compensation nominale

    /* Test 7: Monitoring haute fréquence (500ms) pour détecter variations */
    printf("================================================\r\n");                    // Ligne de séparation
    printf("  MONITORING HAUTE FRÉQUENCE\r\n");                                          // Titre de la phase de monitoring
    printf("================================================\r\n");                    // Ligne de séparation
    printf("Instructions test:\r\n");                                                                 // Introduit le protocole opérateur
    printf("  1. Laisser 30 secondes à l'air libre (baseline)\r\n");                                  // Etape 1 du protocole
    printf("  2. Souffler fumée cigarette près du capteur\r\n");                                      // Etape 2 du protocole
    printf("  3. Observer variation VOC raw\r\n");                                                   // Etape 3 du protocole
    printf("  4. Attendre retour à baseline (~2-3 min)\r\n\r\n");                                   // Etape 4 du protocole
    printf("Format: [Temps] VOC_raw (variation) | VOC_index | Catégorie\r\n");                       // Décrit le format d'affichage des mesures
    printf("------------------------------------------------\r\n\r\n");                             // Ligne de séparation

