TutoElectroWeb/STM32_SGP40/exemples/exemple_sgp40_polling_diagnostic.c
  /* 4) Paramètres runtime du monitoring final */
  uint32_t start_time = HAL_GetTick();                                                        // Horodatage de départ du monitoring
  uint16_t baseline = 0;                                                                     // Baseline construite sur les premières mesures
  uint16_t voc_min = 65535;                                                                  // Minimum observé dans la fenêtre
  uint16_t voc_max = 0;                                                                      // Maximum observé dans la fenêtre
  uint32_t count = 0;                                                                        // Compteur global des mesures monitorées

  
  /* USER CODE END 2 */

  /* Infinite loop */
  /* USER CODE BEGIN WHILE */
  while (1)  // Boucle principale infinie de monitoring debug
  {
      /* 1) Acquisition VOC raw */
        uint16_t voc_raw;                                                                    // Valeur brute lue au cycle courant
        status = SGP40_MeasureRaw(&hsgp40, &voc_raw);                                        // Lecture VOC raw capteur

        static uint8_t error_count = 0U;
        if (status == SGP40_OK) {  // Traite uniquement les mesures valides
            error_count = 0U;
            count++;                                                                         // Incrémente le nombre de mesures réussies

            // 2) Baseline = moyenne des 10 premières mesures
            if (count <= 10) {                                                               // Construit la baseline sur les 10 premières mesures
                baseline += voc_raw / 10;                                                              // Accumule la baseline moyenne
            }

            // 3) Mise à jour min/max
            if (voc_raw < voc_min) voc_min = voc_raw;                                       // Met à jour le minimum local
            if (voc_raw > voc_max) voc_max = voc_raw;                                       // Met à jour le maximum local

            // 4) Calcul variation vs baseline
            int32_t variation = (int32_t)voc_raw - (int32_t)baseline;                                   // Calcule l'écart à la baseline

            // 5) Calcul VOC index
            uint16_t voc_index;                                                              // Index VOC converti depuis la valeur brute
            SGP40_CalculateVOCIndex(&hsgp40, voc_raw, &voc_index);                          // Conversion raw->index VOC
            SGP40_VOC_Category cat = SGP40_GetVOCCategory(voc_index);                       // Catégorie qualitative associée

            // 6) Affichage mesure
                 uint32_t elapsed = (HAL_GetTick() - start_time) / 1000;                                    // Calcule le temps écoulé en secondes
                 printf("[%4lus] %5u (%+5ld) | idx=%3u | %s",                                                // Affiche la ligne principale de monitoring
                   elapsed, voc_raw, variation, voc_index,
                   SGP40_VOCCategoryToString(cat));

            // 7) Alerte variation significative
            if (labs(variation) > 1000) {                                                    // Détecte une variation importante
                printf(" ATTENTION   VARIATION DÉTECTÉE!");                                              // Ajoute une alerte en cas de variation forte
            }

            printf("\r\n");                                                                            // Termine la ligne de sortie

            // 8) Stats toutes les 30 secondes
            if (count % 60 == 0) {                                                           // Imprime une synthèse toutes les 60 mesures
                printf("\r\n--- Stats (dernières 60 mesures) ---\r\n");                             // Introduit la synthèse périodique
                printf("Baseline : %u\r\n", baseline);                                                 // Affiche la baseline courante
                printf("MIN      : %u (écart: %d)\r\n", voc_min, (int)voc_min - (int)baseline);      // Affiche le minimum et son écart
                printf("MAX      : %u (écart: %+d)\r\n", voc_max, (int)voc_max - (int)baseline);     // Affiche le maximum et son écart
                printf("Amplitude: %u\r\n\r\n", voc_max - voc_min);                                  // Affiche l'amplitude observée

                if (voc_max - voc_min < 500) {  // Détecte une amplitude faible sur la fenêtre de mesure
                    printf("ATTENTION   AMPLITUDE FAIBLE: Capteur ne réagit presque pas!\r\n");       // Alerte sur faible dynamique
                    printf("   Causes possibles:\r\n");                                                 // Introduit les hypothèses de diagnostic
                    printf("   - Capteur défectueux ou saturé\r\n");                                    // Hypothèse 1
                    printf("   - Air déjà pollué (baseline élevée)\r\n");                               // Hypothèse 2
                    printf("   - Délai de réponse long (attendre 1-2 min)\r\n\r\n");                  // Hypothèse 3
                }

                // 9) Reset min/max pour nouvelle période
                voc_min = 65535;                                                                       // Réinitialise le minimum pour la fenêtre suivante
                voc_max = 0;                                                                           // Réinitialise le maximum pour la fenêtre suivante
              }
            } else {                                                                                        // Branche erreur de mesure brute
              error_count++;
              printf("ERREUR  Erreur mesure: %s\r\n", SGP40_StatusToString(status));         // Affiche l'erreur de mesure brute
              if (error_count >= 2U) {
                  printf("ERREUR  Erreur I2C répétée (capteur débranché ?)\r\n");
                  Error_Handler();
              }
        }

    /* 10) Cadence fixe à 2 Hz */
    HAL_Delay(500U);                                                                         // Cadence haute fréquence à 2 Hz
    
  /* USER CODE END WHILE */
  }
  /* USER CODE BEGIN 3 */
  SGP40_DeInit(&hsgp40);  /* Jamais atteint en nominal — utile bootloader / tests unitaires */
  /* USER CODE END 3 */
}

/**
  * @brief System Clock Configuration
  * @retval None
  */
void SystemClock_Config(void)
{
  RCC_OscInitTypeDef RCC_OscInitStruct = {0};
  RCC_ClkInitTypeDef RCC_ClkInitStruct = {0};

